In [2]:
import numpy as np
import pandas as pd

In [4]:
df =pd.read_csv('https://stepik.org/media/attachments/course/4852/accountancy.csv')

In [6]:
df.head()

   Unnamed: 0 Executor Type  Salary
0           0     Pupa    D      63
1           1     Pupa    A     158
2           2     Pupa    D     194
3           3     Pupa    E     109
4           4    Loopa    E     184

In [8]:
df.shape

(50, 4)

In [13]:
df.groupby(['Executor','Type'], as_index=False).mean()

   Executor Type  Unnamed: 0      Salary
0     Loopa    A   46.000000   58.000000
1     Loopa    B   24.000000  145.166667
2     Loopa    C   31.666667  154.333333
3     Loopa    D   31.857143  137.714286
4     Loopa    E   23.500000  164.000000
5     Loopa    F   20.000000  238.000000
6      Pupa    A   16.000000  160.833333
7      Pupa    B   41.000000   77.000000
8      Pupa    C   23.000000   74.500000
9      Pupa    D   14.000000  146.500000
10     Pupa    E   19.800000  131.200000
11     Pupa    F   25.750000  136.250000